# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.18-s082_1 on Thu Dec 18 12:04:47 +03 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design custom_riscv_core

create_clock -name "sys_clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_groups -name "clock_groups_sys_clk_to_others" -asynchronous -group [get_clocks sys_clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks sys_clk] -add_delay 2.0 [get_ports rst_n]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[31]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[30]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[29]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[28]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[27]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[26]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[25]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[24]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[23]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[22]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[21]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[20]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[19]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[18]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[17]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[16]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[15]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[14]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[13]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[12]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[11]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[10]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[9]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[8]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[7]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[6]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[5]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[4]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[3]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[2]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[1]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_dat_i[0]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[31]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[30]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[29]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[28]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[27]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[26]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[25]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[24]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[23]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[22]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[21]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[20]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[19]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[18]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[17]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[16]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[15]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[14]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[13]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[12]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[11]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[10]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[9]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[8]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[7]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[6]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[5]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[4]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[3]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[2]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[1]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_i[0]}]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports iwb_ack_i]
set_input_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports dwb_ack_i]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[31]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[30]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[29]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[28]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[27]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[26]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[25]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[24]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[23]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[22]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[21]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[20]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[19]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[18]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[17]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[16]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[15]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[14]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[13]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[12]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[11]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[10]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[9]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[8]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[7]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[6]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[5]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[4]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[3]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[2]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[1]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {iwb_adr_o[0]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports iwb_cyc_o]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports iwb_stb_o]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[31]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[30]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[29]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[28]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[27]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[26]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[25]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[24]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[23]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[22]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[21]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[20]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[19]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[18]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[17]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[16]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[15]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[14]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[13]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[12]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[11]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[10]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[9]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[8]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[7]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[6]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[5]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[4]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[3]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[2]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[1]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_adr_o[0]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[31]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[30]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[29]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[28]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[27]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[26]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[25]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[24]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[23]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[22]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[21]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[20]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[19]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[18]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[17]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[16]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[15]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[14]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[13]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[12]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[11]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[10]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[9]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[8]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[7]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[6]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[5]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[4]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[3]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[2]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[1]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_dat_o[0]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports dwb_cyc_o]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports dwb_stb_o]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports dwb_we_o]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_sel_o[3]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_sel_o[2]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_sel_o[1]}]
set_output_delay -clock [get_clocks sys_clk] -add_delay 3.0 [get_ports {dwb_sel_o[0]}]
set_wire_load_mode "top"
set_clock_uncertainty -setup 0.5 [get_clocks sys_clk]
set_clock_uncertainty -hold 0.5 [get_clocks sys_clk]
